src/DataProcessors/ФормированиеИсторииЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеИсторииЗаявок</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИзменениеСтрокЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИзменениеСтрокЗаявок</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсторияСформирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаявкиПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСостояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСтрокДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/_ИсторияСтрокЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>_ИсторияСтрокЗаявок</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>IDSite</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСообщенияОтправленного</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоСайтом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработкиСайтом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСтрокДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ФормированиеИсторииЗаявок/Ext/ObjectModule.bsl
Функция ПолучитьИзмененияИстории()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	Р.Период,
	|	Р.Документ,
	|	Р.ОсновноеСостояние
	|ПОМЕСТИТЬ Д
	|ИЗ
	|	РегистрСведений.ИзменениеСтрокЗаявок КАК Р
	|ГДЕ
	|	НЕ Р.ИсторияСформирована
	|
	|УПОРЯДОЧИТЬ ПО
	|	Р.Период,
	|	Р.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Р.Период КАК Период,
	|	Р.Документ КАК Документ,
	|	Р.СтрокаЗаявки,
	|	Р.ОсновноеСостояние
	|ИЗ
	|	РегистрСведений.ИзменениеСтрокЗаявок КАК Р
	|ГДЕ
	|	(Р.Документ, Р.ОсновноеСостояние) В
	|			(ВЫБРАТЬ
	|				Д.Документ,
	|				Д.ОсновноеСостояние
	|			ИЗ
	|				Д КАК Д)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	Документ"
	);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура СформироватьИсторию(лДокумент, лСостояние, лПериод, лСписокСтрокЗаявок)
	тСтруктураИсторииСтрок = Новый Структура;
	тСтруктураИсторииСтрок.Вставить("ТекДокумент", лДокумент);
	тСтруктураИсторииСтрок.Вставить("ТекСостояние", лСостояние);
	тСтруктураИсторииСтрок.Вставить("ТекДатаРегистрации", лПериод);
	тСтруктураИсторииСтрок.Вставить("ТекСтроки", лСписокСтрокЗаявок);
	
	НачатьТранзакцию();
	Попытка
		ТаблицаИстории = Неопределено;
		ОбщегоНазначения.СоздатьСтруктуруРегистраСведений("_ИсторияСтрокЗаявок", ТаблицаИстории);
		
		РаботаСоСтатусамиДокументов.СформироватьПолнуюИсторию(тСтруктураИсторииСтрок, ТаблицаИстории); 
		Для Каждого СтрокаИстории Из ТаблицаИстории Цикл
			аЗапись = РегистрыСведений._ИсторияСтрокЗаявок.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(аЗапись, СтрокаИстории);
			аЗапись.Записать(Истина);
		
		КонецЦикла;
		
		Для Каждого КлючИЗначение ИЗ лСписокСтрокЗаявок Цикл
			аЗапись = РегистрыСведений.ИзменениеСтрокЗаявок.СоздатьМенеджерЗаписи();
			азапись.Период = лПериод;
			аЗапись.Документ = лДокумент;
			аЗапись.СтрокаЗаявки = КлючИЗначение.Значение;
			аЗапись.ОсновноеСостояние = лСостояние;
			аЗапись.ИсторияСформирована = Истина;
			
			аЗапись.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		// + Пушкин 20180427
		лОписаниеОшибки = ОписаниеОшибки();
		
		ЗаписьЖурналаРегистрации("Обработка.ФормированиеИсторииЗаявок", УровеньЖурналаРегистрации.Ошибка,,, лОписаниеОшибки);
		ОтменитьТранзакцию();
		
		аларм_стр = "попытка зафиксировать транзакцию не увенчалась успехом:" + Символы.ПС +
					"лДокумент:" + СокрЛП(лДокумент) + Символы.ПС + 
					"лСостояние:" + СокрЛП(лСостояние) + Символы.ПС + 
					"Описание ошибки:" + СокрЛП(лОписаниеОшибки);
		
		РассылкаСообщенийОбОшибках.ОтправитьЭлектронноеСообщениеБезСохранения(Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаФормированияИсторииЗаявок,аларм_стр,"err СформироватьИсторию");
		// - Пушкин 20180427
		
	КонецПопытки;
		
КонецПроцедуры

Процедура ВыполнитьРегламентноеЗадание() Экспорт
	ЗапросИзменений = ПолучитьИзмененияИстории();
	
	Если ЗапросИзменений.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	тДокумент = Неопределено;
	ВыборкаИзменений = ЗапросИзменений.Выбрать();
	Пока ВыборкаИзменений.Следующий() Цикл
		//Если тДокумент = Неопределено Тогда
		//	тДокумент = ВыборкаИзменений.Документ;
		//	тОсновноеСостояние = ВыборкаИзменений.ОсновноеСостояние;
		//	тДатаРегистрации = ВыборкаИзменений.Период;
		//	тСписокСтрокЗаявок = Новый СписокЗначений;
		//	
		//Иначе
		//	Если тДокумент <> ВыборкаИзменений.Документ Тогда
		//		СформироватьИсторию(тДокумент, тОсновноеСостояние, тДатаРегистрации, тСписокСтрокЗаявок);
		//		
		//		тДокумент = ВыборкаИзменений.Документ;
		//		тОсновноеСостояние = ВыборкаИзменений.ОсновноеСостояние;
		//		тДатаРегистрации = ВыборкаИзменений.Период;
		//		тСписокСтрокЗаявок = Новый СписокЗначений;
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
		тДокумент = ВыборкаИзменений.Документ;
		тОсновноеСостояние = ВыборкаИзменений.ОсновноеСостояние;
		тДатаРегистрации = ВыборкаИзменений.Период;
		тСписокСтрокЗаявок = Новый СписокЗначений;
		тСписокСтрокЗаявок.Добавить(ВыборкаИзменений.СтрокаЗаявки);
		СформироватьИсторию(тДокумент, тОсновноеСостояние, тДатаРегистрации, тСписокСтрокЗаявок);
		
	КонецЦикла;
	
	//СформироватьИсторию(тДокумент, тОсновноеСостояние, тДатаРегистрации, тСписокСтрокЗаявок);
		
КонецПроцедуры
